In [95]:
import pandas as pd
dict1 = {'X':[78,85,96,80,86],'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
idx = [0,1,2,3,4]
xyz = pd.DataFrame(dict1,index=idx)
print(xyz)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [97]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=exam_data,index=labels)
print(df)
print(df.info())
print(df.describe())

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None
           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [98]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [99]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [20]:
df.loc[['b','d','f','g'],['score','qualify']]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [32]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [35]:
rows = df.shape[0]
columns = df.shape[1]
print(f"Number of Rows:{rows}")
print(f"Number of Columns:{columns}")

Number of Rows:10
Number of Columns:4

In [39]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [42]:
df[(df['score'] >=15) & (df['score'] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [44]:
df[(df['score'] > 15) & (df['attempts'] < 2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [48]:
df.loc['d','score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [54]:
print("Sum of Examination attempts by the students: ")
df['attempts'].sum()

Sum of Examination attempts by the students:

19

In [55]:
print("Mean score for each different student in data frame: ")
df['score'].mean()

Mean score for each different student in data frame:

13.333333333333334

In [61]:
import pandas as pd
import numpy as np
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(exam_data, index=labels)
print("Original DataFrame:\n", df)
new_row = pd.DataFrame({
    'name': ['Suresh'],
    'score': [15.5],
    'attempts': [1],
    'qualify': ['yes']
}, index=['k'])
df2 = pd.concat([df, new_row])
print("\nDataFrame After Adding New Row 'k':\n", df2)
df3 = df2.drop('k')
print("\nDataFrame After Deleting Row 'k' (Original Restored):\n", df3)

Original DataFrame:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

DataFrame After Adding New Row 'k':
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

DataFrame After Deleting Row 'k' (Original Restored):
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [71]:
df1 = df.sort_values(by=['name','score'],ascending=[False,True])
df1

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [81]:
df['qualify'].replace({'yes': True, 'no': False}, inplace=True)
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [101]:
df.loc['d', 'name'] = 'suresh'
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d     suresh    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes
3     suresh    NaN       NaN     NaN

In [103]:
df['name'].replace({'James':'suresh'},inplace=True)
df

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d     suresh    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes
3     suresh    NaN       NaN     NaN

In [110]:
df = df.drop("attempts", axis=1)
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d     suresh    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes
3     suresh    NaN     NaN

In [113]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data = exam_data,index = labels) 
df.insert(loc=4, column='colors',value = ["Red","Blue","Green","Yellow","Orange","Black","Pink","Purple","white","Red"])
df

        name  score  attempts qualify  colors
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes   Green
d      James    NaN         3      no  Yellow
e      Emily    9.0         2      no  Orange
f    Michael   20.0         3     yes   Black
g    Matthew   14.5         1     yes    Pink
h      Laura    NaN         1      no  Purple
i      Kevin    8.0         2      no   white
j      Jonas   19.0         1     yes     Red

In [115]:
for name,score in df.iterrows():
    print(f"{name}")
    print(f"{score}")

a
name        Anastasia
score            12.5
attempts            1
qualify           yes
colors            Red
Name: a, dtype: object
b
name        Dima
score        9.0
attempts       3
qualify       no
colors      Blue
Name: b, dtype: object
c
name        Katherine
score            16.5
attempts            2
qualify           yes
colors          Green
Name: c, dtype: object
d
name         James
score          NaN
attempts         3
qualify         no
colors      Yellow
Name: d, dtype: object
e
name         Emily
score          9.0
attempts         2
qualify         no
colors      Orange
Name: e, dtype: object
f
name        Michael
score          20.0
attempts          3
qualify         yes
colors        Black
Name: f, dtype: object
g
name        Matthew
score          14.5
attempts          1
qualify         yes
colors         Pink
Name: g, dtype: object
h
name         Laura
score          NaN
attempts         1
qualify         no
colors      Purple
Name: h, dtype: object
i
name        Kevin
score         8.0
attempts        2
qualify        no
colors      white
Name: i, dtype: object
j
name        Jonas
score        19.0
attempts        1
qualify       yes
colors        Red
Name: j, dtype: object

In [116]:
df = pd.DataFrame(exam_data)
column_names = df.columns.tolist()
print(column_names)

['name', 'score', 'attempts', 'qualify']

In [118]:
import pandas as pd
data = {'col1':[1,2,3],'col2':[4,5,6],'col3':[7,8,9]}
df = pd.DataFrame(data)
print("before",df)
df.rename(columns={'col1':'column1','col2':'column2','col3':'column3'},inplace=True)
print("After",df)

before    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
After    column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

In [120]:
data = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data)
df = df.loc[df['col1'] == 4]
df

   col1  col2  col3
1     4     5     8
3     4     7     0

In [122]:
data = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data)
df1 = df.sort_values(by=['col1','col2','col3'],ascending=[True, True, False])
df1

   col1  col2  col3
0     1     4     7
2     3     6     9
1     4     5     8
3     4     7     0
4     5     8     1

In [130]:
data = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data)
newColumn = pd.DataFrame({'col1':[10],'col2':[11],'col3':[12]},index=[5])
df1 = pd.concat([df,newColumn])
df1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [131]:
data = {
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, 6, 7, 8],
    'col3': [7, 8, 9, 0, 1]
}
df = pd.DataFrame(data)
print("Original DataFrame:\n")
print(df)
df.to_csv("new_file.csv", sep='\t', index=False)
print("\nData from new_file.csv file:\n")
df_new = pd.read_csv("new_file.csv", sep='\t')
print(df_new)

Original DataFrame:

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Data from new_file.csv file:

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [135]:
data = {'city':['California','Georgia','Los Angeles'],'No. of Person':[4,2,4]}
df = pd.DataFrame(data)
print("No of Persons:", df['No. of Person'].sum())

No of Persons: 10

In [145]:
data = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data)
df1 = df.drop(1)
df1

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [146]:
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 200)
df = pd.DataFrame({
    'col1': [1,4,3,4,5],
    'col2': [4,5,6,7,8],
    'col3': [7,8,9,0,1]
})
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [149]:
data = {
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, 6, 7, 8],
    'col3': [7, 8, 9, 0, 1]
}
df = pd.DataFrame(data)
result = df.iloc[2]
print("Index-2: Details")
print(result)

Index-2: Details
col1    3
col2    6
col3    9
Name: 2, dtype: int64

In [156]:
import numpy as np
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=exam_data,index=labels)
df.replace({np.nan:0},inplace=True)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    0.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    0.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [162]:
import pandas as pd
import numpy as np
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
             'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no',
                'yes', 'yes', 'no', 'no', 'yes']
}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
df_with_index = df.reset_index()
print("\nAfter converting index into a column:")
print(df_with_index)
print("\nHiding index:")
print(df_with_index.to_string(index=False))

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

After converting index into a column:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Hiding index:
 index      name  score  attempts qualify
     0 Anastasia   12.5         1     yes
     1      Dima    9.0         3      no
     2 Katherine   16.5         2     yes
     3     James    NaN         3      no
     4     Emily    9.0         2      no
     5   Michael   20.0         3     yes
     6   Matthew   14.5         1     yes
     7     Laura    NaN         1      no
     8     Kevin    8.0         2      no
     9     Jonas   19.0         1     yes

In [161]:
data = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data)
df.drop([2,4],inplace=True)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0